# Завдання 1.
#
# Написати рекурсивну функцію знаходження ступеня числа.
#############################################################################################
# перебирает ступень после того как достигнет 0 он в обратном порядке умножает все на
# цифру заданую как в примере 2 ( и умножает 2 на 1) потом (2 на 2) и так вплоть до нужного числа


# def number_degree(num, deg):
#     if deg == 1:
#         return 1
#     return num * number_degree(num, deg - 1)
#
#
# print(number_degree(2, 4))


#############################################################################################
# Завдання 2.
#
# Написати рекурсивну функцію, яка виводить N зірок у ряд, число N задає користувач.
# Проілюструйте роботу функції прикладом. (Протестувати)
#############################################################################################



#############################################################################################
# Завдання 3.
#
# Написати рекурсивну функцію, яка обчислює суму всіх чисел у діапазоні від a до b.
# Користувач вводить a та b. Проілюструйте роботу функції прикладом.
#############################################################################################



#############################################################################################