# Завдання 1.
#
# Написати рекурсивну функцію знаходження ступеня числа.
#############################################################################################
# перебирает ступень после того как достигнет 0 он в обратном порядке умножает все на
# цифру заданую как в примере 2 ( и умножает 2 на 1) потом (2 на 2) и так вплоть до нужного числа


# def number_degree(num, deg):
#     if deg == 1:
#         return 1
#     return num * number_degree(num, deg - 1)
#
#
# print(number_degree(2, 4))


#############################################################################################
# Завдання 2.
#
# Написати рекурсивну функцію, яка виводить N зірок у ряд, число N задає користувач.
# Проілюструйте роботу функції прикладом. (Протестувати)
#############################################################################################
# перебирает значение если равно 0 прекращает выводить, при каждом выводе уменьшает значение на 1


# def stars(count):
#     if count == 0:
#         return count
#     print("*", end=' ')
#     return stars(count-1)
#
#
# stars(5)

#############################################################################################
# Завдання 3.
#
# Написати рекурсивну функцію, яка обчислює суму всіх чисел у діапазоні від a до b.
# Користувач вводить a та b. Проілюструйте роботу функції прикладом.
#############################################################################################
# sum(6) -> 6 + sum(5) => 20
# sum(5) -> 5 + sum(4) => 14
# sum(4) -> 4 + sum(3) => 9
# sum(3) -> 3 + sum(2) => 5
#
# sum(2) => 2

# def sum(a, b):
#     if a == b:
#         return a
#     return a + sum(a+1, b)
#
#
# print(sum(2, 6))

#############################################################################################